//#include <stdio.h>
//#include <stdlib.h>
//int main()
//{
//	unsigned char a=200;
//	unsigned char b=100;
//	unsigned char c=0;
//	c=a+b;//整形提升
//	//a以二进制存储00000000000000000000000011001000
//	//由于unsigned 只能存储整数且范围为0~255
//	//所以a的存储形式为11001000
//	//b以二进制存储00000000000000000000000001100100
//	//同理b也是如此
//	//所以b的存储形式为01100100
//	//进行整形提升之后再相加由于为unsigned所以前面补0
//	//00000000000000000000000011001000
//	//00000000000000000000000001100100
//	//计算结果0000000000000000000000100101100
//	//unsigned的c存储为这个00101100
//	//%d为十进制位的a+b，所以依旧为300
//	//由于打印的是%d类型而c是char类型所以要发生整型提升 高位补0
//	//c为00000000000000000000000000101100
//	//为44
//	printf("%d %d",a+b,c);
//	system("pause");
//    return 0;
//}
//
//

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
int main()
{
	//char b=129;存储不了129  把char想象为一个圆从0到127后变成-128
	//char类型的变量里面存储的大小从-128 -->127
	char a[1000]={0};
	int i=0;
	for(i=0;i<1000;i++)
	{
		a[i]=-1-i;
	}
	printf("%d\n",strlen(a));
	//printf("%d\n",b);
	system("pause");
    return 0;
}


