#include <stdio.h>
#include <stdlib.h>
int main()
{

	char a=10;
	char b=8;
	char c=a+b;
	printf("%d\n",c);
	system("pause");
	return 0;
}




////整形提升，是按照变量的数据类型的符号位来提升的
//#include <stdio.h>
//#include <stdlib.h>
//int main()
//{
//	char a=3;
//	//00000000000000000000000000000011
//	//由于a占用一个字节，所以要发生截取，所以留后面的00000011
//	char b=127;
//	//00000000000000000000000001111111
//	//01111111
//	char c=a+b;
//	//a+b
//	//00000000000000000000000000000011
//	//00000000000000000000000001111111
//	//00000000000000000000000010000010
//
//	//c=10000010
//	//11111111111111111111111100000010-补码
//	//11111111111111111111111100000001-反码
//	//10000000000000000000000011111110-原码
//	printf("%d\n",c);
//	system("pause");
//	return 0;
//}



//#include <stdio.h>
//#include <stdlib.h>
//
////计算一个整数二进制中有几个1
//int main()
//{
//	int num=0;
//	int count =0;
//	int i=0;
//	scanf("%d",&num);
//	//统计a的补码中有几个1
//	////while(a!=0)
//	////{
//	////	if(a%2==1)
//	////	{
//	////		count++;这种方法没办法算负数
//	////	}
//	////	a=a/2;
//	////}
//	
//	for(i=0;i<32;i++)
//	{
//		if(1==((num>>i)&1))
//			count++;
//	}
//	printf("%d\n",count);
//	system("pause");
//	return 0;
//}